<a href="https://colab.research.google.com/github/indracahyaramdani/PSDS/blob/main/Modul_4_DataFrame_Bagian_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text] (https://drive.google.com/file/d/1rDKM3AHLEvjANy4k9_oCmTuvqx4gZxne/view?usp=sharing)

# **Pembahasan :**
1. Memahami beberapa Fungsi yang ada pada Pandas DataFrame
2. Cara mengecek Missing Value dan NaN
3. Cara melihat mean/median/ std per kolom
4. Cara melihat jumah data dalam kolom dengan kriteria, misal kolom B=1

#**Memahami Beberapa Fungsi pada Pandas DataFrame**

Pada kesempatan kali ini fungsi yang akan kita bahas ada 4, 
yaitu : 
1. Fungsi info()
2. Fungsi describe()
3. Fungsi count()
4. Fungsi value_counts()

Sebelum masuk ke pembahasan utama kita buat DataFrame sederhana berupa Dictionary terlebih dahulu

Misal :

In [ ]:
import pandas as pd

#membuat DataFrame
data = {'Nama': ['Putra', 'Putra', 'Putra', 'Siti', 'Siti', 'Siti' ], 
        'Semester': [1, 2, 3, 1, 2, 3],
        'IPK': [2.95, 3.20, 3.50, 3.10, 3.34, 3.50]}
df = pd.DataFrame(data)
df

    Nama  Semester   IPK
0  Putra         1  2.95
1  Putra         2  3.20
2  Putra         3  3.50
3   Siti         1  3.10
4   Siti         2  3.34
5   Siti         3  3.50

##**Fungsi info()**

Fungsi info() sangat berguna untuk mengetahui keterangan dari objek DataFrame yang kita buat seperti index dari DataFrame lengkap dengan range dari index, jumlah kolom beserta informasi tiap kolom untuk null data dan tipe data, dan jumlah total penggunaan memory pada tiap kolom dalam satuan bytes

In [ ]:
#cek info dari DataFrame yang kita buat diatas
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nama      6 non-null      object
 1   Semester  6 non-null      int64
 2   IPK       6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

##**Fungsi describe()**

Fungsi describe() untuk mengetahui data statistika deskriptif untuk setiap kolom yang bertipe data numeric seperti count, mean, standard deviation, maximum, minum, dan quartile

In [ ]:
#cek statiska data numeric
df.describe()

       Semester       IPK
count  6.000000  6.000000
mean   2.000000  3.265000
std    0.894427  0.222149
min    1.000000  2.950000
25%    1.250000  3.125000
50%    2.000000  3.270000
75%    2.750000  3.460000
max    3.000000  3.500000

Jika kita ingin menampilkan data deskriptif untuk salah satu kolom saja cukup dengan menuliskan nama kolom tersebut menggunakan kurung siku

In [ ]:
#misal kita ingin mengetaui data statistik dari kolom Semester
df['Semester'].describe()

count    6.000000
mean     2.000000
std      0.894427
min      1.000000
25%      1.250000
50%      2.000000
75%      2.750000
max      3.000000
Name: Semester, dtype: float64

##**Fungsi count()**

Fungsi count() berfungsi untuk menghitung jumlah baris dari setiap kolom yang ada pada DataFrame

In [ ]:
#cek jumlah baris pada setiap kolom
df.count()

Nama        6
Semester    6
IPK         6
dtype: int64

Jika kita ingin mengitung jumlah baris pada salah satu kolom saja cukup dengan menuliskan nama kolom tersebut menggunakan kurung siku

In [ ]:
#misal kita ingin menghitung jumlah baris pada kolom IPK
df['IPK'].count()

6

##**Fungsi value_counts()**

Fungsi value_count berfungsi untuk mendapatkan seri yang berisi jumlah nilai unik. objek yang dihasilkan akan berada dalam urutan menurun sehingga elemen pertama adalah elemen paling sering muncul

In [ ]:
#cek value counts nya
df.value_counts()

Nama   Semester  IPK
Siti   3         3.50    1
       2         3.34    1
       1         3.10    1
Putra  3         3.50    1
       2         3.20    1
       1         2.95    1
dtype: int64

Jika kita ingin mendapatkan seri yang berisi jumlah nilai unik pada salah satu kolom saja cukup dengan menuliskan nama kolom tersebut menggunakan kurung siku

In [ ]:
#misal kita coba pada kolom IPK
df['IPK'].value_counts()

3.50    2
2.95    1
3.34    1
3.10    1
3.20    1
Name: IPK, dtype: int64

#**Mengecek Missing Value dan NaN**

In [ ]:
# Membuat DataFrame

import pandas as pd
import numpy as np

data = {
    'Nama' : ['Esa','Rena','Tia','Dino','Ita','Via','Osi','Bian','Sasa','Gea'],
    'Gender' : [np.nan,'P','P','L',np.nan,'P','P','L','P','P'],
    'Usia' : [21,20,20,np.nan,21,22,20,np.nan,20,np.nan],
    'Berat Badan' : [39,38,41,np.nan,50,53,44,np.nan,48,41],
    'Tinggi Badan' : [158,np.nan,163,157,168,160,np.nan,170,np.nan,160]
}

data = pd.DataFrame(data,columns=['Nama','Gender','Usia','Berat Badan','Tinggi Badan'])
print(data)

   Nama Gender  Usia  Berat Badan  Tinggi Badan
0   Esa    NaN  21.0         39.0         158.0
1  Rena      P  20.0         38.0           NaN
2   Tia      P  20.0         41.0         163.0
3  Dino      L   NaN          NaN         157.0
4   Ita    NaN  21.0         50.0         168.0
5   Via      P  22.0         53.0         160.0
6   Osi      P  20.0         44.0           NaN
7  Bian      L   NaN          NaN         170.0
8  Sasa      P  20.0         48.0           NaN
9   Gea      P   NaN         41.0         160.0

Pada Python Pandas memungkinkan kita untuk menemukan missing value seacara cepat dan tepat pada data, dapat menggunakan fungsi isnull() atau isna()

In [ ]:
# Mengecek missing value secara keseluruhan menggunakan fungsi isnull()
data.isnull()

    Nama  Gender   Usia  Berat Badan  Tinggi Badan
0  False    True  False        False         False
1  False   False  False        False          True
2  False   False  False        False         False
3  False   False   True         True         False
4  False    True  False        False         False
5  False   False  False        False         False
6  False   False  False        False          True
7  False   False   True         True         False
8  False   False  False        False          True
9  False   False   True        False         False

In [ ]:
# Mengecek menggunakan fungsi isna()
data.isna()

    Nama  Gender   Usia  Berat Badan  Tinggi Badan
0  False    True  False        False         False
1  False   False  False        False          True
2  False   False  False        False         False
3  False   False   True         True         False
4  False    True  False        False         False
5  False   False  False        False         False
6  False   False  False        False          True
7  False   False   True         True         False
8  False   False  False        False          True
9  False   False   True        False         False

In [ ]:
# Mengecek missing value di setiap kolom
data.isnull().any()

Nama            False
Gender           True
Usia             True
Berat Badan      True
Tinggi Badan     True
dtype: bool

Kita dapat mengetahui jumlah data yang missing value dari ke seluruhan data.

In [ ]:
data.isnull().sum().sum()

10

Kita juga dapat mengetahui jumlah missing value setiap kolom dengan menggunakan 3 metode :
- Menggunakan fungsi isnull() serta sum()
- Menggunakan fungsi isna() serta sum()
- Menggunakan fungsi len() serta count()

In [ ]:
# Menggunakan fungsi isnull() serta sum()
data.isnull().sum()

Nama            0
Gender          2
Usia            3
Berat Badan     2
Tinggi Badan    3
dtype: int64

In [ ]:
# Menggunakan fungsi isna() serta sum()
data.isna().sum()

Nama            0
Gender          2
Usia            3
Berat Badan     2
Tinggi Badan    3
dtype: int64

In [ ]:
# Menggunakan fungsi len() serta fungsi count()
count_nan = len(data) - data.count()
count_nan

Nama            0
Gender          2
Usia            3
Berat Badan     2
Tinggi Badan    3
dtype: int64

Dan untuk mengetahui jumlah missing value dari setiap baris dapat menggunakan 2 metode :
- Menggunakan fungsi isnull() serta sum() dengan axis = 1
- Menggunakan fungsi isnull() serta sum() dengan for loop

In [ ]:
#Menggunakan fungsi isnull() serta sum() dengan axis = 1
data.isnull().sum(axis = 1)

0    1
1    1
2    0
3    2
4    1
5    0
6    1
7    2
8    1
9    1
dtype: int64

In [ ]:
# Menggunakan fungsi isnull() serta sum() dengan for loop
for i in range(len(data.index)) :
    print("NaN in row ", i , " : " ,  data.iloc[i].isnull().sum())

NaN in row  0  :  1
NaN in row  1  :  1
NaN in row  2  :  0
NaN in row  3  :  2
NaN in row  4  :  1
NaN in row  5  :  0
NaN in row  6  :  1
NaN in row  7  :  2
NaN in row  8  :  1
NaN in row  9  :  1

#**Melihat Mean / Median / Standar Deviasi per Kolom**

Kita gunakan contoh DataFrame sebelumnya untuk melihat mean/median/ standar deviasi

Untuk mencari nilai rata-rata per kolom, menggunakan fungsi mean()

In [ ]:
# Mengecek mean
data.mean()

Usia             20.571429
Berat Badan      44.250000
Tinggi Badan    162.285714
dtype: float64

Untuk mencari nilai tengah dari data per kolom, digunakan fungsi median()

In [ ]:
# Mengecek median
data.median()

Usia             20.0
Berat Badan      42.5
Tinggi Badan    160.0
dtype: float64

Untuk mencari nilai standar deviasi per kolom dapat menggunakan fungsi std()

In [ ]:
# Mengecek standar deviasi
data.std()

Usia            0.786796
Berat Badan     5.496752
Tinggi Badan    4.990467
dtype: float64

#**Melihat jumlah data dalam kolom dengan kriteria, misal kolom B=1**

Kita gunakan contoh DataFrame sebelumnya untuk melihat jumlah data dalam kolom dengan kriteria, misal kolom B=1

In [ ]:
# Melihat jumlah data dalam kolom 'Usia' dengan kriteria usia 20
data[(data['Usia']) == 20].groupby(['Usia']).size().reset_index(name='Jumlah')

   Usia  Jumlah
0  20.0       4